An enumerated type listing all fabrication custom data value types.
  Namespace:   Autodesk.Revit.DB.Fabrication
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
  Since:  2017 Subscription Update
 Syntax
  C#
public enum FabricationCustomDataType
  Visual Basic
Public Enumeration FabricationCustomDataType
  Visual C++
public enum class FabricationCustomDataType
 Members
  Member name  |   Description
   Text   |   Text data type
   Integer   |   Integer data type
   Real   |   Real number data type.
 See Also
  Autodesk.Revit.DB.Fabrication Namespace